Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4c/include/sam4c32c_1.h
/**
 * \file
 *
 * Copyright (c) 2013-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */
#ifndef _SAM4C32C_1_
#define _SAM4C32C_1_

/** \addtogroup SAM4C32C_definitions SAM4C32C definitions
  This file defines all structures and symbols for SAM4C32C:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif 

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAM4C32C */
/* ************************************************************************** */
/** \addtogroup SAM4C32C_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M4 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M4 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M4 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M4 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M4 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M4 System Tick Interrupt       */
/******  SAM4C32C specific Interrupt Numbers *********************************/
  
  SUPC_IRQn            =  0, /**<  0 SAM4C32C Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 SAM4C32C Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 SAM4C32C Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 SAM4C32C Real Time Timer (RTT) */
  WDT_IRQn             =  4, /**<  4 SAM4C32C Watchdog Timer (WDT) */
  PMC_IRQn             =  5, /**<  5 SAM4C32C Power Management Controller (PMC) */
  EFC0_IRQn            =  6, /**<  6 SAM4C32C Enhanced Embedded Flash Controller 0 (EFC0) */
  EFC1_IRQn            =  7, /**<  7 SAM4C32C Enhanced Embedded Flash Controller 1 (EFC1) */
  UART0_IRQn           =  8, /**<  8 SAM4C32C UART 0 (UART0) */
  PIOA_IRQn            = 11, /**< 11 SAM4C32C Parallel I/O Controller A (PIOA) */
  PIOB_IRQn            = 12, /**< 12 SAM4C32C Parallel I/O Controller B (PIOB) */
  USART0_IRQn          = 14, /**< 14 SAM4C32C USART 0 (USART0) */
  USART1_IRQn          = 15, /**< 15 SAM4C32C USART 1 (USART1) */
  USART2_IRQn          = 16, /**< 16 SAM4C32C USART 2 (USART2) */
  USART3_IRQn          = 17, /**< 17 SAM4C32C USART 3 (USART3) */
  USART4_IRQn          = 18, /**< 18 SAM4C32C USART 4 (USART4) */
  TWI0_IRQn            = 19, /**< 19 SAM4C32C Two Wire Interface 0 (TWI0) */
  TWI1_IRQn            = 20, /**< 20 SAM4C32C Two Wire Interface 1 (TWI1) */
  SPI0_IRQn            = 21, /**< 21 SAM4C32C Serial Peripheral Interface 0 (SPI0) */
  UOTGHS_IRQn          = 22, /**< 22 SAM4C32C USB Host / Device Full/Low Speed Port (UOTGHS) */
  TC0_IRQn             = 23, /**< 23 SAM4C32C Timer/Counter 0 (TC0) */
  TC1_IRQn             = 24, /**< 24 SAM4C32C Timer/Counter 1 (TC1) */
  TC2_IRQn             = 25, /**< 25 SAM4C32C Timer/Counter 2 (TC2) */
  TC3_IRQn             = 26, /**< 26 SAM4C32C Timer/Counter 3 (TC3) */
  TC4_IRQn             = 27, /**< 27 SAM4C32C Timer/Counter 4 (TC4) */
  TC5_IRQn             = 28, /**< 28 SAM4C32C Timer/Counter 5 (TC5) */
  ADC_IRQn             = 29, /**< 29 SAM4C32C Analog To Digital Converter (ADC) */
  ARM1_IRQn            = 30, /**< 30 SAM4C32C FPU signals : FPIXC, FPOFC, FPUFC, FPIOC, FPDZC, FPIDC, FPIXC (ARM1) */
  IPC0_IRQn            = 31, /**< 31 SAM4C32C Interprocessor communication 0 (IPC0) */
  SLCDC_IRQn           = 32, /**< 32 SAM4C32C Segment LCD Controller (SLCDC) */
  TRNG_IRQn            = 33, /**< 33 SAM4C32C True Random Generator (TRNG) */
  ICM_IRQn             = 34, /**< 34 SAM4C32C Integrity Check Module (ICM) */
  CPKCC_IRQn           = 35, /**< 35 SAM4C Public Key Cryptography Controller (CPKCC) */
  AES_IRQn             = 36, /**< 36 SAM4C32C Advanced Enhanced Standard (AES) */
  PIOC_IRQn            = 37, /**< 37 SAM4C32C Parallel I/O Controller C (PIOC) */
  UART1_IRQn           = 38, /**< 38 SAM4C32C UART 1 (UART1) */
  IPC1_IRQn            = 39, /**< 39 SAM4C32C Interprocessor communication 1 (IPC1) */
  SPI1_IRQn            = 40, /**< 40 SAM4C32C Serial Peripheral Interface 1 (SPI1) */
  PWM_IRQn             = 41, /**< 41 SAM4C32C Pulse Width Modulation (PWM) */

  PERIPH_COUNT_IRQn    = 42  /**< Number of peripheral IDs */
} IRQn_Type;

